Repository: DevExpress/AjaxControlToolkit
Catalog: Backup/ScriptResources/BaseScriptsResources.*-*.resx
Languages: cht, nl, tr_tr

# AlwaysVisible_ElementRequired
source: Sys.Extended.UI.AlwaysVisibleControlBehavior must have an element
cht: 必須替 Sys.Extended.UI.AlwaysVisibleControlBehavior 指定一個項目
nl: Sys.Extended.UI.AlwaysVisibleControlBehavior moet een element hebben
tr_tr: Sys.Extended.UI.AlwaysVisibleControlBehavior element içermek zorundadır

# Animation_CannotNestSequence
source: Sys.Extended.UI.Animation.SequenceAnimation cannot be nested inside Sys.Extended.UI.Animation.ParallelAnimation
cht: Sys.Extended.UI.Animation.ParallelAnimation 不能內含 Sys.Extended.UI.Animation.SequenceAnimation
nl: Sys.Extended.UI.Animation.SequenceAnimation kan niet genest worden binnen Sys.Extended.UI.Animation.ParallelAnimation
tr_tr: Sys.Extended.UI.Animation.SequenceAnimation Sys.Extended.UI.Animation.ParallelAnimation içinde yer alamaz

# Animation_ChildrenNotAllowed
source: Sys.Extended.UI.Animation.createAnimation cannot add child animations to type "{0}" that does not derive from Sys.Extended.UI.Animation.ParentAnimation
cht: Sys.Extended.UI.Animation.createAnimation 無法加入一個不是衍生自 Sys.Extended.UI.Animation.ParentAnimation 且類型為 {0} 的子動畫
nl: Sys.Extended.UI.Animation.createAnimation kan geen deelanimaties toevoegen aantype "{0}" omdat deze niet afgeleid is van Sys.Extended.UI.Animation.ParentAnimation
tr_tr: Sys.Extended.UI.Animation.createAnimation Sys.Extended.UI.Animation.ParentAnimation dan türetilmeyen alt animasyonları "{0}" tipine ekleyemez

# Animation_InvalidBaseType
source: Sys.Extended.UI.Animation.registerAnimation can only register types that inherit from Sys.Extended.UI.Animation.Animation
cht: Sys.Extended.UI.Animation.registerAnimation 只能註冊那些繼承自 Sys.Extended.UI.Animation.Animation 的類型
nl: Sys.Extended.UI.Animation.registerAnimation kan alleen types registreren die afgeleid zijn van Sys.Extended.UI.Animation.Animation
tr_tr: Sys.Extended.UI.Animation.registerAnimation sadece Sys.Extended.UI.Animation.Animation dan türetilmiş tipleri kayıt edebilir

# Animation_InvalidColor
source: Color must be a 7-character hex representation (e.g. #246ACF), not "{0}"
cht: 標記名稱 Color 必須是 7 個字元的 16 進位字串（例如：#246ACF），不能是 {0}
nl: Color moet een hexadecimale notatie van 7 tekens zijn (bijv. #246ACF), niet "{0}"
tr_tr: Renk tanımı "{0}" şeklinde değil 7-karakter 16'lık sayı düzeninde belirtilmelidir (örneğin #246ACF)

# Animation_MissingAnimationName
source: Sys.Extended.UI.Animation.createAnimation requires an object with an AnimationName property
cht: Sys.Extended.UI.Animation.createAnimation 必須持有一個 AnimationName 屬性的物件
nl: Sys.Extended.UI.Animation.createAnimation vereist een object met een AnimationName-eigenschap
tr_tr: Sys.Extended.UI.Animation.createAnimation AnimationName özelliği olan bir objeye ihtiyaç duyar

# Animation_NoDynamicPropertyFound
source: Sys.Extended.UI.Animation.createAnimation found no property corresponding to "{0}" or "{1}"
cht: Sys.Extended.UI.Animation.createAnimation 找不到相對應的 {0} 或 {1} 屬性
nl: Sys.Extended.UI.Animation.createAnimation vond geen eigenschap corresponderend met "{0}" of "{1}"
tr_tr: Sys.Extended.UI.Animation.createAnimation "{0}" veya "{1}" ile uygun bir özellik bulamadı

# Animation_NoPropertyFound
source: Sys.Extended.UI.Animation.createAnimation found no property corresponding to "{0}"
cht: Sys.Extended.UI.Animation.createAnimation 找不到相對應的 {0} 屬性
nl: Sys.Extended.UI.Animation.createAnimation vond geen eigenschap corresponderend met "{0}"
tr_tr: Sys.Extended.UI.Animation.createAnimation "{0}" ile uygun bir özellik bulamadı

# Animation_TargetNotFound
source: Sys.Extended.UI.Animation.Animation.set_animationTarget requires the ID of a Sys.UI.DomElement or Sys.UI.Control. No element or control could be found corresponding to "{0}"
cht: Sys.Extended.UI.Animation.Animation.set_animationTarget 需要一個 Sys.UI.DomElement 或 Sys.UI.Control 類別的控制項 ID。找不到相對應的 {0} 之項目或控制項
nl: Sys.Extended.UI.Animation.Animation.set_animationTarget vereist dat de ID van een Sys.UI.DomElement of Sys.UI.Control. Er kon geen element of control gevonden worden corresponderend met "{0}"
tr_tr: "{0}" ile uygun element veya kontrol bulunamadı. Sys.Extended.UI.Animation.Animation.set_animationTarget Sys.UI.DomElement veya Sys.UI.Control ID ye ihtiyaç duyar.

# Animation_UknownAnimationName
source: Sys.Extended.UI.Animation.createAnimation could not find an Animation corresponding to the name "{0}"
cht: Sys.Extended.UI.Animation.createAnimation 找不到名稱為 {0} 的動畫
nl: Sys.Extended.UI.Animation.createAnimation kon geen Animation vinden corresponderend met de naam "{0}"
tr_tr: Sys.Extended.UI.Animation.createAnimation "{0}" isminde bir Animasyon bulamadı

# Calendar_Today
source: Today: {0}
cht: 今天: {0}
nl: Vandaag: {0}
tr_tr: Bugün: {0}

# CascadingDropDown_MethodError
source: [Method error {0}]
cht: [方法錯誤 {0}]
nl: [Methodefout {0}]
tr_tr: [Metot hatası {0}]

# CascadingDropDown_MethodTimeout
source: [Method timeout]
cht: [方法逾時]
nl: [Methodetimeout]
tr_tr: [Metot zaman aşımı]

# CascadingDropDown_NoParentElement
source: Failed to find parent element "{0}"
cht: 無法找到父項目 {0}
nl: Kon geen bovenliggend element "{0}" vinden
tr_tr: "{0}" kök elementi bulunamadı

# CollapsiblePanel_NoControlID
source: Failed to find element "{0}"
cht: 無法找到項目 {0}
nl: Kon element "{0}"niet vinden
tr_tr: "{0}" elementi bulunamadı

# Common_DateTime_InvalidFormat
source: Invalid format
cht: 格式無效
nl: Ongeldige notatie
tr_tr: Yanlış format

# Common_DateTime_InvalidTimeSpan
source: "{0}" is not a valid TimeSpan format
cht: {0} 的 TimeSpan 格式無效
nl: De eenheid "{0}"' is niet geldig voor parseBorderWidth
tr_tr: "{0}" geçerli bir TimeSpan formatı değil

# Common_InvalidBorderWidthUnit
source: A unit type of "{0}"' is invalid for parseBorderWidth
cht: 單位類型 {0} 對 parseBorderWidth 而言無效
tr_tr: "{0}" birim tipi parseBorderWidth için geçersiz

# Common_InvalidPaddingUnit
source: A unit type of "{0}" is invalid for parsePadding
cht: 單位類型 {0} 對 parsePadding 而言無效
nl: De eenheid "{0}" is niet geldig voor parsePadding
tr_tr: "{0}" birim tipi parsePadding için geçersiz

# Common_UnitHasNoDigits
source: No digits
cht: 沒有數字
nl: Geen cijfers
tr_tr: Rakam yok

# DynamicPopulate_WebServiceError
source: Web Service call failed: {0}
cht: 無法呼叫 Web 服務：{0}
nl: Web Service-aanroep mislukt: {0}
tr_tr: Web Servis çağrısı başarısız oldu: {0}

# DynamicPopulate_WebServiceTimeout
source: Web service call timed out
cht: 呼叫 Web 服務逾時
nl: Web Service heeft niet tijdig gereageerd
tr_tr: Web Servis çağrısı zaman aşımına uğradı

# ExtenderBase_CannotSetClientStateField
source: clientStateField can only be set before initialization
cht: 只能在初始化之前設定 clientStateField
nl: clientStateField kan alleen vóór initialisatie worden ingesteld
tr_tr: clientStateField sadece başlangıç noktasından önce ayarlanabilir

# ExtenderBase_ControlNotRegisteredForCallbacks
source: This Control has not been registered for callbacks
cht: 這個控制項尚未註冊，無法提供回呼
nl: Deze control is niet geregistreerd voor callbacks
tr_tr: Bu kontrol geri arama işlemleri için kaydedilmedi

# ExtenderBase_InvalidClientStateType
source: saveClientState must return a value of type String
cht: saveClientState 必須傳回 String 型別的值
nl: saveClientState moet een waarde van het type string retourneren
tr_tr: saveClientState String tipinde bir değer döndürmelidir

# ExtenderBase_PageNotRegisteredForCallbacks
source: This Page has not been registered for callbacks
cht: 這個頁面尚未註冊，無法提供回呼
nl: Deze pagina is niet geregistreerd voor callbacks
tr_tr: Bu sayfa geri arama işlemleri için kaydedilmedi

# ListSearch_DefaultPrompt
source: Type to search
cht: 請鍵入以便搜尋
nl: Typ om te zoeken
tr_tr: Arama için yazın

# PasswordStrength_DefaultStrengthDescriptions
source: NonExistent;Very Weak;Weak;Poor;Almost OK;Barely Acceptable;Average;Good;Strong;Excellent;Unbreakable!
cht: 沒有;很弱;弱;差;差強人意;尚可;普通;好;很好;非常好;臻於完美！
nl: Geen enkel;Zeer zwak;Zwak;Matig;Bijna in orde;Net voldoende;Gemiddeld;Goed;Sterk;Uitstekend;Onbreekbaar!
tr_tr: Kabul Edilemez;Çok Zayıf;Zayıf;Biraz Zayıf;Vasat;Kabul Edilebilir;Ortalama;İyi;Güçlü;Mükemmel;Kırılamaz!

# PasswordStrength_GetHelpRequirements
source: Get help on password requirements
cht: 取得密碼複雜性的要求說明
nl: Hulp voor wachtwoord-vereisten
tr_tr: Şifre gereksinimleri hakkında yardım al

# PasswordStrength_InvalidStrengthDescriptions
source: Invalid number of text strength descriptions specified
cht: 所指定的密碼複雜性文字內容個數無效
nl: Ongeldig aantal tekststerkte-beschrijvingen opgegeven
tr_tr: Yanlış sayıda şifre yetkinliği tanımı belirlendi

# PasswordStrength_InvalidStrengthDescriptionStyles
source: Text Strength description style classes must match the number of text descriptions.
cht: 密碼複雜性文字說明的樣式表，必須符合文字內容之個數
nl: Text Strength beschrijvingsstijl-klassen moeten met het aantal tekstbeschrijvingen overeenkomen.
tr_tr: Şifre yetkinliği tanımlama stil sınıfları yazım tariflerinin sayısına eşit olmalıdır

# PasswordStrength_InvalidWeightingRatios
source: Strength Weighting ratios must have 4 elements
cht: 密碼複雜性的權重比例必須有 4 種
nl: Strength Weighting ratio's moeten 4 elementen hebben
tr_tr: Şifre yetkinliği oranı 4 elemente sahip olmalıdır

# PasswordStrength_RemainingCharacters
source: {0} more characters
cht: 還需要 {0} 個字元
nl: nog {0} tekens
tr_tr: {0} harf daha

# PasswordStrength_RemainingMixedCase
source: Mixed case characters
cht: 大小寫混合
nl: Hoofd- en kleine letters
tr_tr: Karmaşık tipte harf

# PasswordStrength_RemainingNumbers
source: {0} more numbers
cht: 還需要 {0} 個數字
nl: nog {0} cijfers
tr_tr: {0} sayı daha

# PasswordStrength_RemainingSymbols
source: {0} symbol characters
cht: 還需要 {0} 個符號
nl: nog {0} symbooltekens
tr_tr: {0} sembol daha

# PasswordStrength_Satisfied
source: Nothing more required
cht: 密碼複雜性已經足夠
nl: Niets meer benodigd
tr_tr: Şifre yetkinliği sağlandı

# PasswordStrength_StrengthPrompt
source: Strength:
cht: 複雜性：
nl: Sterkte:
tr_tr: Şifre yetkinliği:

# PopupControl_NoDefaultProperty
source: No default property supported for control "{0}" of type "{1}"
cht: 類型 {1} 的 控制項 {0} 不支援預設屬性
nl: Geen standaard-eigenschap ondersteund voor control "{0}" van type "{1}"
tr_tr: "{1}" tipindeki "{0}" kontrolü için varsayılan bir özellik belirlenmedi

# PopupExtender_NoParentElement
source: Couldn't find parent element "{0}"
cht: 無法找到父項目 {0}
nl: Kon geen bovenliggend element "{0}" vinden
tr_tr: "{0}" kök elementi bulunamadı

# Rating_CallbackError
source: An unhandled exception has occurred:\r\n{0}
cht: 發生未處理的例外狀況：\r\n{0}
nl: Een niet-afgehandelde uitzondering is opgetreden:\r\n{0}
tr_tr: İşlenemez bir hata oluştu:\r\n{0}

# ReorderList_DropWatcherBehavior_CallbackError
source: Reorder failed, see details below.\r\n\r\n{0}
cht: 無法重新排列，請參考下面的說明：\r\n\r\n{0}
nl: Herschikken mislukt; zie details hieronder.\r\n\r\n{0}
tr_tr: Yeniden düzenleme başarısız oldu, detayı aşağıda.\r\n\r\n{0}

# ReorderList_DropWatcherBehavior_NoChild
source: Could not find child of list with id "{0}"
cht: 無法找到 ID 為 {0} 的子清單
nl: Kon geen onderliggend element van lijst met id "{0}" vinden
tr_tr: Listede id "{0}" olan bir alt birim bulunamadı

# ResizableControlBehavior_CannotChangeProperty
source: Changes to {0} not supported
cht: 不支援對 {0} 的變更
nl: Veranderingen voor {0} niet ondersteund
tr_tr: {0} üstündeki değişiklikleri desteklenmemektedir

# ResizableControlBehavior_InvalidHandler
source: {0} handler not a function, function name, or function text
cht: {0} 處理常式不是函式、函式名稱、或是函式文字
nl: {0} handler is geen functie, functienaam of functietekst
tr_tr: {0} işleyicisi fonksiyon, fonksiyon ismi veya fonksiyon metni değil

# Shared_BrowserSecurityPreventsPaste
source: Your browser security settings don't permit the automatic execution of paste operations. Please use the keyboard shortcut Ctrl+V instead.
cht: 您的瀏覽器安全性設定，不允許執行自動貼上的操作。請改用鍵盤快速鍵 Ctrl + V。
nl: De beveiligingsinstellingen van uw browser staan het automatisch uitvoeren van de plak-bewerking niet toe. Gebruik in plaats hiervan de toetsencombinatie Ctrl+V.
tr_tr: Tarayıcınızın güvenlik ayarları otomatik yapıştırma işlemine izin vermemektedir. Lütfen Ctrl+V klavye kısayolunu kullanın.

# Slider_NoSizeProvided
source: Please set valid values for the height and width attributes in the slider's CSS classes
cht: 請在 Slider 的 CSS Class 中，設定高度與寬度屬性的有效值
nl: Stel geldige waarden in voor de height en width-CSS-attributen van de sliders CSS-klassen
tr_tr: Lütfen kaydırıcının (slider) CSS sınıflarında genişlik ve yükseklik için geçerli değerler kullanın

# Tabs_ActiveTabArgumentOutOfRange
source: Argument is not a member of the tabs collection
cht: 參數不是索引標籤 (Tab) 集合的成員
nl: Het opgegeven argument maakt geen deel uit van de tabverzameling
tr_tr: Argüman sekme koleksiyonunun bir üyesi değil

# Tabs_OwnerExpected
source: owner must be set before initialize
cht: 於初始化之前，必須設定擁有者
nl: owner moet ingesteld worden vóór initialisatie
tr_tr: Başlangıç noktasına gelmeden önce sahip belirlenmelidir

# Tabs_PropertySetAfterInitialization
source: {0} cannot be changed after initialization
cht: 於初始化之後，無法變更 {0}
nl: {0} kan na initialisatie niet meer worden gewijzigd
tr_tr: Başlangıç noktası geçildikten sonra {0} değiştirilemez

# Tabs_PropertySetBeforeInitialization
source: {0} cannot be changed before initialization
cht: 於初始化之前，無法變更 {0}
nl: {0} kan vóór initialisatie niet worden gewijzigd
tr_tr: Başlangıç noktasına varılmadan önce {0} değiştirilemez

# ValidatorCallout_DefaultErrorMessage
source: This control is invalid
cht: 這個控制項無效
nl: Deze control is niet geldig
tr_tr: Bu kontrol geçersiz
